0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    # includeEtc "caseDicts/setConstraintTypes"

    moving1_inlet
    {
        type            fixedValue;
        value           uniform (0 0 1);
    }
    moving2_inlet
    {
        type            fixedValue;
        value           uniform (0 0 1);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    moving1_wall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
	moving2_wall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    stationary_wall
    {
        type            noSlip;
    }
	moving_coupled
    {
        type            zeroGradient;
    }
    stationary_coupled
    {
        type            zeroGradient;
    }
    
}


// ************************************************************************* //
