0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    # includeEtc "caseDicts/setConstraintTypes"
	
	moving1_inlet
    {
        type            zeroGradient;
    }
    moving2_inlet
    {
        type            zeroGradient;
    }
	outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    moving1_wall
    {
        type            zeroGradient;
    }
	moving2_wall
    {
        type            zeroGradient;
    }
    stationary_wall
    {
        type            zeroGradient;
    }
	moving_coupled
    {
        type            zeroGradient;
    }
    stationary_coupled
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
