0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00375;

boundaryField
{
    # includeEtc "caseDicts/setConstraintTypes"

    moving1_inlet
    {
        type            fixedValue;
        value           uniform 0.00375;
    }
    moving2_inlet
    {
        type            fixedValue;
        value           uniform 0.00375;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.00375;
        value           uniform 0.00375;
    }
    moving1_wall
    {
        type            kqRWallFunction;
        value           uniform 0.00375;
    }
    moving2_wall
    {
        type            kqRWallFunction;
        value           uniform 0.00375;
    }
    stationary_wall
    {
        type            kqRWallFunction;
        value           uniform 0.00375;
    }
    moving_coupled
    {
        type            zeroGradient;
    }
    stationary_coupled
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
